Revit 2027 API
DividedPath.AreCurveReferencesConnected Method
 This checks if the references represent a connected set of curves as required by the divided path.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool AreCurveReferencesConnected(
	Document document,
	IList<Reference> curveReferences
)
Public Shared Function AreCurveReferencesConnected (
	document As Document,
	curveReferences As IList(Of Reference)
) As Boolean
public:
static bool AreCurveReferencesConnected(
	Document^ document,
	IList<Reference^>^ curveReferences
)
static member AreCurveReferencesConnected :
        document : Document *
        curveReferences : IList<Reference> -> bool
Parameters
document Document
 The document.
curveReferences IList<Reference>
 The references.
Return Value
Boolean
 True if the arguments passed the checks, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
DividedPath Class
Autodesk.Revit.DB Namespace